<?php

return array(
		
	//'配置项'=>'配置值'
	//'SESSION_AUTO_START' => true, //是否开启session
	'URL_CASE_INSENSITIVE' => true,
	'HHJ_API_KEY' => 'rxhdu4iekro9333jdh6d', //对外接口校验KEY
	'MOBILE_VALID_TIME' => 60, //手机号校验过期时间
	'CACHE_USER_TOKEN' => 'cache_user_token', //例子 $key_id = array('user_id'=>11,'token'=>'ddswwewrwer','equipment'=>'ssdfasee')	
	'CACHE_SHOP_GOODS' => 'cache_shop_goods', //商户商品列表
	'JPUSH_URL'=>'https://api.jpush.cn/v3/push',
	'JPUSH_SHOP_APPKEY'=>'a6af0cbe3623c50153542f20',
	'JPUSH_SHOP_MASTERSECRET'=>'ac92721deb21f2c4d3f474cd',
	'JPUSH_ANDROID_APPKEY' => 'e78dcf0bcb7994f3b6c8a9ee',
	'JPUSH_ANDROID_MASTERSECRET' => '3bf43ad32fba6ec72d328d1e',
	'JPUSH_IOS_APPKEY' => '567ac4363cbb31db26e67618',
	'JPUSH_IOS_MASTERSECRET' => 'c7449010d4416c2b8ec46584',
		
	'ERR_CODE' => array(
		
		/*内部错误*/
		'10101' => '系统错误',
		'10102' => '服务暂停',
		'10103' => '远程服务错误',
		'10104' => 'APP版本过低，请安装新版本',

		'10201' => '数据库查询失败',
		'10202' => '数据库更新失败',

		'10301' => 'Accept-Encoding为空',
		'10302' => 'Client-Version为空',
		'10303' => 'Lang为空',
		'10304' => 'Os为空',			
		'10305' => 'Sign验证失败',
		'10306' => 'Token校验失败',
		'10307' => '您的账号在%s设备上登陆',
		'10401' => '当前页面不能为空',
		'10402' => '城市code不能为空',
		'10403' => '参数错误',
		'10404' => '上传文件不存在',
		'10405' => '文件上传失败',
			
		/*用户模块*/
		'20101' => '手机号不能为空',
		'20102' => '手机号格式不正确',
		'20103' => '密码不能为空',
		
		'20104' => '校验码不能为空',
		'20105' => '验证码错误',
		'20106' => '来源不能为空',
		'20107' => '手机序列号不能为空',
		'20108' => '用户注册失败',
			
		'20109' => '用户或密码错误',
		'20110' => '请您在%d小时后用此手机登陆',
		'20111' => '帐号被禁用',
		'20112' => '设备名称为空',
		'20113' => '用户未登录',
		'20114' => '手机号已注册',
		'20115' => '退出失败',
			
		'20116' => '提示类型不能为空',	
		'20117' => '设备更换,请您24小时后登录',

		/*优惠券*/
		'20201' => '您暂时没有优惠券',
			
		/*公用模块*/
		'20301' => '验证类型为空',
		'20302' => '请稍后再尝试',
		'20303' => '获取验证码失败',
		'20304' => '非法版本参数',
			
		/*店铺模块*/
		'20401' => '经度不能为空',
		'20402' => '纬度不能为空',
		'20403' => '区域ID不能为空',
		
		/*地址模块*/
		'20501' => '地址ID不能为空',
		'20502' => '收货人名字不能为空',
		'20503' => '地址不能为空',
		'20504' => '收货人手机号不能为空',
		'20505' => '区域信息不能为空',
		'20506' => '城市ID不能为空',
		'20507' => '省份ID不能为空',		
			
		/*店铺模块*/
		'20601' => '店铺ID不能为空',
		'20602' => '您附近暂无网店',
		'20603' => '店铺已经收藏',
		'20604' => '店铺不存在',
			
		/*订单模块*/
		'20701' => '商品列表不能为空',
		'20702' => '商品格式错误',
		'20703' => '订单编号不能为空',
		'20704' => '订单不存在',
		'20705' => '店铺ID不能为空',
		'20706' => '购物车ID不能为空',
		'20707' => '收货地址不存在',
		'20708' => '店铺不存在',
		'20709' => '价格参数获取失败',
		'20710' => '订单生产失败',
		'20711' => '优惠券不存在或失效',
		'20712' => '优惠券未满足使用条件',
		'20713' => '超时订单无法取消',
		'20714' => '订单无法删除',
		'20715' => '确认收货失败',
		'20716' => '商品金额小于起送金额,请在支付和配送中选择到店自提',
		'20717' => '此店已不支持网上下单',
		'20718' => '放假中,暂不配送哦!',
		'20719' => '此店暂不配送,请在支付和配送中选择到店自提',
			
		/*购物车模块*/
		'20801' => '购物车商品错误',
		'20802' => '购物车商品状态错误',
		'20803' => '购物车商品价格错误',
		'20804' => '商品ID不能为空',
		'20805' => '商品数量不能为空',
		'20806' => '购物车ID不能为空',
		'20807' => '商品数不能超过99个',
		
		/*优惠券模块*/
		'20901' => '优惠券已绑定或不存在',
		'20902' => '优惠券号码不能为空',
		'20903' => '优惠券仅限VIP使用',
		'20904' => '优惠券ID不能为空',
			
		/*首页banner广告模块*/
		'21001' => 'bannerID不能为空',
		'21002' => '搜索内容为空',
			
		/*订单评分模块*/
		'21101' => '订单评分失败',
		'21102' => '订单已评分',
		'21103' => '请选择评价等级',
		'21104' => '评价内容不能为空',
			
		/*加盟模块*/
		'21201' => '姓名不能为空',
		'21202' => '身份证号不能为空',
		'21203' => '手机不能为空',
		'21204' => '店铺名称不能为空',
		'21205' => '店主姓名不能为空',
		'21206' => '店主手机不能为空',
		'21207' => '开户银行不能为空',
		'21208' => '开户人姓名不能为空',
		'21209' => '开户支行不能为空',
		'21210' => '银行卡帐号不能为空',
		'21211' => '请上传证件照与网店的合照',
		'21212' => '请上传证件照正面图片',
		'21213' => '请上传证件照背面图片',
		'21214' => '请上传银行卡照片',
		'21215' => '请上传营业执照照片',
		'21216' => '申请人姓名不能为空',
		'21217' => '申请人性别不能为空',
		'21218' => '出生年月不能为空',
		'21219' => '身份证地址不能为空',
		'21220' => '身份证不能为空',
		'21221' => '手机不能为空',
		'21222' => '固定电话不能为空',
		'21223' => '申请公司名称不能为空',
		'21224' => '申请公司地址不能为空',
		'21225' => '联系电话不能为空',
		'21226' => '邮箱不能为空',
		'21227' => '主要经营业务不能为空',
		'21228' => '申请人在本公司担任的职务不能为空',
		'21229' => '年销售额不能为空',
		'21230' => '注册资金不能为空',
		'21231' => '申请加盟地区不能为空',
		'21232' => '计划投入资金不能为空',
		'21233' => '选择哈哈镜产品的理由不能为空',
		'21234' => '姓名不能为空',
		'21235' => '身份证号不能为空',
		'21236' => '手机不能为空',
		'21237' => '店铺名称不能为空',
		'21238' => '店主姓名不能为空',
		'21239' => '店主手机不能为空',
		'21240' => '商户编号不能为空',
		'21241' => '商户编号格式不正确',
		'21242' => '商户编号已存在',
			
		//订货模块
		'22001' => '商户ID不能为空',
		'22002' => '增加减少类型不能为空',
		'22003' => '商品ID不能为空',
		
	),
	
	/*来源类型*/
	'SOURCE_TYPE' => array(
		0 => '未知来源',
		1 => '官方网站',
		2 => '安卓APP',
		3 => '苹果APP',
		4 => '官方微信',
		99 => '开发测试'
	),
		
	'SMS_EXPIRE_TIME' => 10 * 60, //短信验证码过期时间
	'SMS_INTERVAL_TIME' => 60, //短信发送间隔	
	
	'MESSAGE_GET_TIME' =>30 * 24 * 60 * 60, //我的消息获取时间
	
	'PAY_STATUS' => 0, //线上支付开关   1为开启  0为关闭
	
	
	//商品辣度 HHJ自有
	'GOODS_PUNGENT' => array(
		0 => '不辣',
		1 => '微辣',
		2 => '正辣',
		3 => '辣'
	),
		
	//用户取消理由列表
	'USER_REFUSE_TYPE' => array(
		0 => '不想要了',
		1 => '时间太慢',
		2 => '配送错误',		
	),
	
	
	//分类配置
	'GOODS_CATEGORY' => array(
		1 => array('cat_id'=>1, 'cat_name'=>'哈哈镜卤味','cat_ids'=>array(5,1,2,3,4), 'cat_type'=>0 ,'pic'=>C('IMG_HTTP_URL').'category/1_90.png'), 
		2 => array('cat_id'=>2, 'cat_name'=>'哈哈镜优选', 'cat_ids'=>array(15,16,17,18,36),'cat_type'=>0,'pic'=>C('IMG_HTTP_URL').'category/2_113.png'),
		3 => array('cat_id'=>3, 'cat_name'=>'休闲食品',  'cat_ids'=>array(19,20,21,22),'cat_type'=>1 ,'pic'=>C('IMG_HTTP_URL').'category/3_108.png'),
		4 => array('cat_id'=>4, 'cat_name'=>'酒水烟饮', 'cat_ids'=>array(15,16,17,36,37,38,39), 'cat_type'=>1 ,'pic'=>C('IMG_HTTP_URL').'category/9.png'),
		5 => array('cat_id'=>5, 'cat_name'=>'蛋肉生鲜', 'cat_ids'=>array(25), 'cat_type'=>1 ,'pic'=>C('IMG_HTTP_URL').'category/5_106.png'),
		6 => array('cat_id'=>6, 'cat_name'=>'日常用品', 'cat_ids'=>array(31,32,33,34),'cat_type'=>1 ,'pic'=>C('IMG_HTTP_URL').'category/10.png'),
		7 => array('cat_id'=>7, 'cat_name'=>'果蔬奶品', 'cat_ids'=>array(18,23,24,26),'cat_type'=>1 , 'pic'=>C('IMG_HTTP_URL').'category/7_104.png'),
		8 => array('cat_id'=>8, 'cat_name'=>'方便速食', 'cat_ids'=>array(27,28,29,30), 'cat_type'=>1 ,'pic'=>C('IMG_HTTP_URL').'category/8_99.png')
	),
	
);